...
# int
#number = 5
#age = 27

# float
#fnumber = 5.7

# str
#name = "Damir"

# bool
#status = True or False

#  вывод коментария
# можно писать все что угодно
# конкотенация

#print("Привет меня зовут " + name)
#print("мне " + str (age) + " лет!)

#name = input("введите свое имя")
#age = input("Укажите свой возраст")
#place = input("вы гражданин какой страны ")
#food = input ("какое блюдо ты любишь больше всего? ")
#print("привет" + name + "!" )
#print("тебе уже" + age + " это круто !!!")
#print("я был 1 раз в " + place + " это прекрастная страна" )
#print("я пробывал один раз " + food +  " и мне понравилось есть  " )



# +, -, /, **, %, унарный минус, округление, пи
#a = 5
#b = 10
#c = b % 3
#унапный минус
#a = 10
#a = - a
#округление
#a = 5.65
#print(round (a))
#import  math
#a = 5.65
#print(math.floor(a))-В МЕНЬШУЮ СТОРОНУ ОКРУГЛЕНИЕ ПРИНУДИТЕЛЬНО
#print(math.ceil(a)) - В БОЛЬШУЮ СТОРОНУ ОКРУГЛЯЕТ ПРИНУДИТЕЛЬНО
#import  math
#print(math.pi)

# Дибильный калькулятор

#what = input("Что делаем?(+, -): " )
#a = float(input("Введи первое число: "))
#b = float(input("Введи второе число: "))
#if what == "+" :
 #   c = a + b
 #   print("Результат : " + str(c))
#elif what == "-" :
#    c = a - b
#    print("Результат : " + str(c))
#else:
#   print("Выбрана не верная операция!")












































