
#name = 'str(1324.4)'
#print(name)
#name = "Hel"
#name2 = "lo"
#v = name + name2 (можно только стоку и число)  (v = name *3 привер)
#print(v)
# index
name = "Hel"
#print(name[1])
# срез строки
#name = 'he'
#print(name[])
#
# [idex]  индек
# [start:stop:step] срез
#len(name) Длинна строки
#print(len(name)) #*20)
#print(name)


#str = "hello"
#str2 = "world"
#print(f"{str} amazing {str2}")
#print(f"%s amazing %s" %(str,str2))
#print("")




#1
# Напишите скрипт, который принимает в себя два пароля. Если пароли совпдают,
#вывести "Успех", иначе "Пароли не совпадают". (Пароль не должен быть короче 8
#символов, но не длиннее 16).

#par= input("напиши пароль")
#par2 = input("повтори пожалуйста")
#if len(par) > 8 and len(par2) < 16 :
 #   if par == par2 :
 #       print("пароль верный")
 #   else:
 #       print("ты ошибся")
#elif len(par) < 8 :
 #   print("ты что то упустил")
#else:
#    print("перебор цифр")

#2.
# Вам дана строка: "hELlo woRLd". Выведите первое слово в нижнем регистре (Но
#первая буква должна быть заглавной), а второе в вверхнем.
# a = "hELlo woRLd"
#print(a [0:5].title(), a[6:].upper())

#3.
# Вам даны две строки. Нужно найти есть ли одна строка в другой строке вне
#зависимости от регистра. Если есть вывести "Есть", иначе "Нет"
#one = input('напиши строку')
#two = input('напиши еще одну')
#if one in two :
  #  print('все ок')
#else:
 #   print('ошибочка вышла')

#4.
# Вам дана строка. Если символ предпоследнего индекса строки - гласная буква, то
#вывести строку длиною в 16 символов, которая полностью состоит из этой буквы.

#one = "Более"
#two = one
#if two [-2] :
#    print(two [-2]*16)
#5. Вам дана строка в camelCase - "pythonIsTheBestLanguage". Вывести ее в snake_case.














































