'''
Переменная-это хранилище данных
= -это оператор присваивание
*  это умножения
/ -это деления с дробной частью
// -это деления c округлением в меньшую сторону
** -это возведение во степень
% -это получения остатка от деления
> -это оператор сравнения (больше)
< - оператор сравнения (меньше)
== -сравнивает на идентичность
!= сравнивает на различие
True -это прав
False -это правда
print() -это функция для распечатки данных
type() -это функция для порверки типа данных значения
help ("keywords")  слова какие нельзя писать
two = zwei = deux = 2
'''

#a = 10
#b = 25
#c = a + b
#d = c + 5
#print(d)
#two = zwei = deux = 2
#two = two + 4
#two += + 4
#print(divmod (11,3)) #11 // 3 , 11 % 3,

#0b 0B = двоичная система  (bin)
#0o 0O = восмеричная система  (oct)
#0x 0X = шеснадцатиричная система (hex)






























