...
# int
#number = 5
#age = 27

# float
#fnumber = 5.7

# str
#name = "Damir"

# bool
#status = True or False

#  вывод коментария
# можно писать все что угодно
# конкотенация

#print("Привет меня зовут " + name)
#print("мне " + str (age) + " лет!)

# name = input("Укажите свое Имя: ")
# last_name = input("Укажите свою Фамилию: ")
# age = int(input("Укажите свой возраст: "))
# gender = input("Выберите пол М / Ж: ")
# if gender == "М":
#         print("Буду иметь ввиду")
# elif gender == "Ж":
#         print("Буду иметь ввиду")
# else:
#         print("Не шути так")
# study = input("Вы учитесь?: ")
# if study == "да":
#         a = (input("В каком направление?: "))
#         print("Вау Это круто")
# elif study == "нет":
#         print("Ничего страшного, я тоже!!!")
# else:
#         print("Eror")
# work = input("Вы работаете?: ")
# if work == str("да"):
#         print("Ты унивесальная личность,горжусь тобой!!!")
# elif work == str("нет"):
#         print("Помогать Родителям это тоже работа:)")
# else:
#         print("Eror")
# prog = input("Изучали ли программирование ранее?: ")
# if prog == "да":
#         print("Отлично,Ты уже победитель!!!")
# elif prog == "нет":
#         print("Никогда не поздно начать,в Light Code прекрасно учат!!!")
# else:
#         print("Eror")
# many = input("Ваша желаемая заробатная плата в месяц?: ")
# if many >= '100000':
#         print("Ты идешь в правильеом направлении!!!")
# elif many >= '70000':
#         print("Отлично, но согласись это не придел")
# elif many >= '50000':
#         print("Ты молодец,тебе есть куда рости")
# elif many >= '20000':
#         print("Давай так: Я знаю ты можешь больше!")
# else:
#         print("Брось свои шуточки")

# print("привет" + name + "!" )
# print("тебе уже" + age + " это круто !!!")
# print("я был 1 раз в " + place + " это прекрастная страна" )
# print("я пробывал один раз " + food +  " и мне понравилось есть  " )




# +, -, /, **, %, унарный минус, округление, пи
#a = 5
#b = 10
#c = b % 3
#унапный минус
#a = 10
#a = - a
#округление
#a = 5.65
#print(round (a))
#import  math
#a = 5.65
#print(math.floor(a))-В МЕНЬШУЮ СТОРОНУ ОКРУГЛЕНИЕ ПРИНУДИТЕЛЬНО
#print(math.ceil(a)) - В БОЛЬШУЮ СТОРОНУ ОКРУГЛЯЕТ ПРИНУДИТЕЛЬНО
#import  math
#print(math.pi)

# Дибильный калькулятор

# what = input("Что делаем?(+,-,*,/ ): ")
# a = float(input("Введи первое число: "))
# b = float(input("Введи второе число: "))
# if what == "+" :
#     c = a + b
#     print("Результат : " + str(c))
# elif what == "-" :
#     c = a - b
#     print("Результат : " + str(c))
# elif what == "*" :
#     c = a * b
#     print("Результат : " + str(c))
# elif what == "/" :
#     c = a / b
#     print("Результат : " + str(c))
# else:
#     print("Так делать нельзя")

# a1 = float(input("Вы хотите продолжить? (да,нет):"))
# if a1 == "да":
#     print()
# elif a1 == "нет":
#     print(" всего доброго")
# # print("Всего доброго" + str(a1))












































