"""
-----------------------------------------------------------------------------------------------------------------------------------------
|Режим| Описание
-----------------------------------------------------------------------------------------------------------------------------------------
|'r'  |  Только для чтения.
-----------------------------------------------------------------------------------------------------------------------------------------
|'w'  |  Только для записи. Создаст новый файл, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'rb' |  Только для чтения (бинарный).
-----------------------------------------------------------------------------------------------------------------------------------------
|'wb' |  Только для записи (бинарный). Создаст новый файл, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'r+' |  Для чтения и записи.
-----------------------------------------------------------------------------------------------------------------------------------------
|'rb+'|  Для чтения и записи (бинарный).
-----------------------------------------------------------------------------------------------------------------------------------------
|'w+' |  Для чтения и записи. Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'wb+'|  Для чтения и записи (бинарный). Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'a'  |  Откроет для добавления нового содержимого. Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'a+' |  Откроет для добавления нового содержимого. Создаст новый файл для чтения записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'ab' |  Откроет для добавления нового содержимого (бинарный). Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'ab+' |  Откроет для добавления нового содержимого (бинарный). Создаст новый файл для чтения записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
Стоит обратить внимание, что в Windows стандартной кодировкой является cp1252, а в Linux — utf-08.
"""

#p = open('file', mode='r', buffering=-1,
 #        encoding=None,errors=None, newline=None,closefd=True, opener=None)
# work with file
#p.close()



#f = open('text.txt', 'r')

# d = 'Hello'
# g = f.read()
# if d in g:
#     print(True)
# print(f.(3))
# print(f.readline(3))
# print(f.readlines())
# for i in f:
#     print(i)
# print(*f)
#f.close()


# f = open('text.txt', 'r')
# f.close()

#with open('text.txt M', 'r') as f:
    # print(f.read())
 #   for i in f:
  #      print(i)
















































