
#списки [list]
a = [12,456,324,'fnon','sksn',['xmks'], 324, 12, 967,'wkl']      #s = '[123,456,789]'
                                                #d = s.split()
                                                  #print(d)
s = [123,789,5,12]  # *а распаковывает может в любом месте
#s.append(10)     #добавляет елемент в конец списка
#s.extend(a) #распаковка
#s.insert(1,777) добавит что пожелаешь
#s.remove(5)  #принемает один обьект который можно удалить
#s.pop(1) удаляет по индексу
#print(a.index(967)) element,  start , stop
#print(a.count()) #находить похожие элементы и выводит сколько их
#s.sort() сортирует по возрю или по алфовиту
#s.reverse() разворачивает
#d = s.copy() # [*s]
#a[3] = 'zamena' #список можно изменить
#print(a)

# Картежи (tuple)  тоже как и список но не изменяемый тип данных в ()

#s = ('asd',123,['qwe',345],(390,682))
#a = (*s,'add')
#print(a)

#print(*map(lambda x: chr(int(x)), iter(input, '0')))














